#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-feb-15-2-5314.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a5c25c60-a436-428a-a59d-cc90b2dc6315]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=fcfcf6f6-f1e3-4fd5-b1f0-e96622d25d1e]
module.keycloak_dev.module.onestopauth.module.client_test-feb-15-2-5314.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=39c50380-6d39-4f51-beab-50234387adcb]
module.keycloak_dev.module.onestopauth.module.client_description-test-2344.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=25f0ebd0-2a7d-4508-a203-33e1086fa924]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-2608.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=791b8fce-9229-4756-9137-0322b45131d3]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9103fa5e-10ce-49bc-b821-03dcdf91f541]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-2608.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=77e88bc0-fcb2-48a8-bedc-071e7761db60]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-2608.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=40dae292-0e00-44c9-8c53-30ccf11dc040]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-2608.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2340bd54-b4ec-4ddf-900a-3737aea6ee0a]
module.keycloak_dev.module.onestopauth.module.client_realm-profile-app-2608.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f09c37d4-8886-419d-b0e5-fb751d92bf5c]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ec1e3c7c-ee70-41ae-88df-fa012dd9a06a]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbef5ee2-09af-4e7d-97f1-1284679cce4b]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=82be4825-528a-4d35-89c1-6b612acad0e9]
module.keycloak_dev.module.onestopauth.module.client_test-1.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=80fc7074-a8d1-4e13-a4fe-888f65238859]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a42c1d94-9fcb-4b93-9a88-676a1a70b3f3]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300a9df0-f7f6-48d2-b0d3-bfc1cfeabbc3]
module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5335ef93-71d3-4381-91bb-c805c348ab06]
module.keycloak_dev.module.onestopauth.module.client_test-3-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6b67ec10-ac9c-469b-96aa-3b1627801392]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=203caf5b-7262-4a5e-95e1-2016477c08ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b3a2ad3e-de7d-4181-bfd5-3f883f0f7620]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=bde3707f-383d-4d20-a79d-e4c4f7931b1f]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7af5bb55-d337-43fe-b601-35dfceb6b9ce]
module.keycloak_dev.module.onestopauth.module.client_testclient-10.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=fdd1b368-149a-4755-899c-397f192c302d]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=296675df-c53f-4a4f-ae61-15b1c75e6121]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b5979477-2f87-43ec-841c-29461eff6267]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=488e3989-0e02-4ba1-aa6d-ca48f11c9fc5]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=06a1f71b-7f6c-41e1-bda8-730e1e66bd2a]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80d34657-7917-444a-9153-a6ddd84cc2da]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=04fe619b-7246-4a95-a449-19a2d1f26746]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2e2e23be-db94-4528-b9a4-281624eae1f4]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=58edf72e-a0f4-446e-8479-a43b7828a9f8]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=42be6ded-fe54-4139-ae9c-066d24b60f10]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c16ea373-1dcb-4974-aa1e-b7855c84afc4]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c1a3b516-1e66-4387-bfcb-be6146cd4df0]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3581290c-b8db-43cf-8200-7a2e7a181f13]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f30895ba-f722-4299-b4e5-df3d83f3a8b0]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c6e1bcb3-b7b4-4f9e-86bb-43f44d58ba03]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4a354f0c-193f-486b-bddd-3eefc893731b]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aea4d6c6-73a3-426a-9e22-57302f342e18]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=28c2b610-f326-4432-a070-d6a53a73e545]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1e33299f-6543-4a86-8be2-2df9259e26a6]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8767f238-14c1-40a7-b5c7-637225122ce7]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=614c4c6e-6791-4223-bf67-7e3c5c2c5fad]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5ad85904-0600-416b-8440-2dad61e3c18b]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b021dd34-f5ef-47b2-8e6f-ed1b7b0a9546]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea842bec-22b1-44d1-b68a-8f5a05dd7f7f]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=afc2c666-9e52-474e-89a6-1999728688e6]
module.keycloak_dev.module.onestopauth.module.client_idir-azure-3796.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=115d737f-d2f4-45bb-87a2-4daaf88f2487]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2bf49bc1-34d6-44d6-96ed-5bd2fde36869]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=74956dc4-e394-4d03-b95a-94bac1859151]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ae916d49-4606-4e9c-af45-71f98d8b57af]
module.keycloak_dev.module.onestopauth.module.client_test-31-1552.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cec4da8-844c-4ca6-82c7-88a12f9f358e]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0ceab70d-9bfc-429a-9f3a-ad176d13f244]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=644454a0-18ee-4337-b136-f77c0d0f2077]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1c284bce-00b0-4fb2-a91d-6f074538b0a2]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c4b0139d-00aa-4243-8f42-9498401e1501]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=75bca75e-f7d7-4de8-ab7e-4e76901ae8ca]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=916ee66d-a8b5-4245-a017-de284fc24705]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b502c1a-c266-4e70-8c61-bd149a822bb0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9c526bb9-bfb4-4911-9563-d307eeb8561b]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5486d873-9227-4f7f-90c7-fb55af354dc0]
module.keycloak_dev.module.onestopauth.module.client_test-3-07-29-2021-266.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=d2238682-f4ce-4363-8908-0bb99903871e]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=893bcbd7-ec2b-45eb-8359-43eea32080ac]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a36bcc19-e38e-4dc4-8057-fdd0df8aaf1c]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=18b27aaf-2063-4ebb-9bc0-cf591a598fed]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1df968fd-634b-4617-82a3-5d92023b099c]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a6cbab4-f80d-4251-bdd5-8db332d97ff9]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=635e7b98-bb38-4259-b61f-80b709a7afd1]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=1490fb53-d535-4748-aa94-56625cc29b62]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6c0252f9-423f-47b3-a7e4-530f772bdd35]
module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b4c16169-bb29-4d85-94b0-e78825886711]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f8220213-5d69-45ec-ab15-e1070dbf1305]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=958158a6-eb69-4efd-b102-80265d62e24a]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f98c02aa-f7f3-40fa-a161-ccabeb75dedd]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d3e82ce3-1763-4668-9148-27140d4b6494]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0055cedc-4a82-4b56-91a0-ee9c2a32bd3c]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=3cafb241-d313-4358-82e6-d869c4709766]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=234f7f2d-0968-4059-82ed-099e0dd2e3fe]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunabcedfg-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8025e9f6-2fe6-4037-b4f0-584658f1e2f7]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0f6f8dd9-b6af-48e0-8662-7a4de1b675c4]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=05224e67-b8fa-443b-871f-acb3040e8bbb]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9bbbb147-8a84-49b3-a0bf-3ef8da612f54]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8922455-5068-4300-add2-dc1604ebf9ee]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fc9681b6-d792-4ba9-95b0-a51bebcdf52c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8a1c0c79-82b1-4433-aec2-04139bd9e83c]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=99ffa2ac-d2f0-4891-a4cb-e5995275f66a]
module.keycloak_dev.module.onestopauth.module.client_automergetestproject-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7b14c264-b280-422b-b073-ac2200b070e7]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ba6b53a8-14d2-477b-a14b-86b8cade2108]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=76709862-4fec-47a7-9a1c-66dfdb0dd267]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4f505a0b-c7e8-4d1d-9125-d7c38f13e6ea]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1dd7cbe2-be93-49fe-8fec-b8c1c496d1eb]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e1a321a0-44fc-4e27-a627-d09bccba5cd5]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=7b99a1f1-daeb-4321-ae19-68a7c9163a2e]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d755043-106c-4be5-a4a1-8f0c08813461]
module.keycloak_dev.module.onestopauth.module.client_asdfsafa-1322.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=173b4f85-6750-4c6b-9422-91abe97112d1]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-bceid-dev-and-test-5513"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-bceid-dev-and-test-5513"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_dev.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-bceid-dev-and-test-5513"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-bceid-dev-and-test-5513"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://example",
        ]
      + web_origins                              = [
          + "+",
          + "https://example",
        ]
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "tians-testing-bceid-dev-and-test-5513"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "tians-testing-bceid-dev-and-test-5513"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-both"
    }

  # module.keycloak_test.module.onestopauth_both.module.client_tians-testing-bceid-dev-and-test-5513.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "tians-testing-bceid-dev-and-test-5513"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "tians-testing-bceid-dev-and-test-5513"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-both"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://exampleddd",
        ]
      + web_origins                              = [
          + "+",
          + "https://exampleddd",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3546 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*